Tekla Open API Reference for Tekla Structures 2025
BooleanPart Fields
The BooleanPart type exposes the following members.
Fields
Name | Description
BooleanOperativeClassName
 A constant string that defines a part class name to be the boolean operative part. This class must be used when inserting the operative part to the database.
Top
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace